# IsCurveReferenceValid Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedPath..::..IsCurveReferenceValid Method
DividedPath Class See Also
---
This returns true if the reference represents a curve or edge that can be used to create a divided path.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsCurveReferenceValid(
	Document document,
	Reference curveReference
)
```

Visual Basic
---
```text
Public Shared Function IsCurveReferenceValid ( _
	document As Document, _
	curveReference As Reference _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsCurveReferenceValid(
	Document^ document,
	Reference^ curveReference
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
curveReference
    Type: Autodesk.Revit.DB..::..Reference The reference.
# ### Return Value
True if the reference can be used to create a divided path, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DividedPath Class
Autodesk.Revit.DB Namespace